[
    {"text": "I'm not sure if I'll continue using this IT support service.", "intent": "Churn"},
    {"text": "I am so fed up with your service. I think I want to unsubscribe.", "intent": "Churn"},
    {"text": "I'm getting nowhere with you. I need a competent representative who can help.", "intent": "Escalation"},
    {"text": "The service I received from your company was unsatisfactory, and I have started looking into other services out there. I insist on speaking with a senior representative or someone in upper management who can rectify the situation and restore my confidence in your company.", "intent": "Churn and Escalation"},
    {"text": "How can I change my email address in the account settings?", "intent": "No Intent Found"},
    {"text": "I've been a loyal customer for years, but recently I've been extremely frustrated with your poor service and thinking of opting out. I want to discuss this issue with your team leader, someone who can understand the complexities and provide an appropriate solution.", "intent": "Churn and Escalation"},
    {"text": "Is there a mobile app available for your service?", "intent": "No Intent Found"},
    {"text": "I'm seriously considering ending my subscription with your IT support service.", "intent": "Churn"},
    {"text": "I'm fed up with your service. I'm thinking of canceling my subscription.", "intent": "Churn"},
    {"text": "I'm not satisfied with your support. I need someone who can actually help.", "intent": "Escalation"},
    {"text": "I had a terrible experience with your company. I want to talk to a higher authority to resolve this.", "intent": "Churn and Escalation"},
    {"text": "How do I update my phone number in the account settings?", "intent": "No Intent Found"},
    {"text": "I've been a loyal customer for a long time, but your recent service has been disappointing. I'm considering leaving and want to discuss this with your team leader.", "intent": "Churn and Escalation"},
    {"text": "Can I use your service on my smartphone?", "intent": "No Intent Found"},
    {"text": "I'm unsure about continuing my subscription with your IT support service.", "intent": "Churn"},
    {"text": "Your service has been a constant source of frustration. I'm thinking of unsubscribing.", "intent": "Churn"},
    {"text": "I'm making no progress with your support team. I need a competent person to assist me.", "intent": "Escalation"},
    {"text": "I had a terrible experience with your company's service, and I'm exploring alternatives. I want to speak to a senior representative.", "intent": "Churn and Escalation"},
    {"text": "How can I change my billing address in my account?", "intent": "No Intent Found"},
    {"text": "I've been a loyal customer, but your recent service is unacceptable. I'm thinking of leaving and want to discuss this with someone who can help.", "intent": "Churn and Escalation"},
    {"text": "Is there a mobile app for your service?", "intent": "No Intent Found"},
    {"text": "I'm considering ending my subscription with your IT support service.", "intent": "Churn"},
    {"text": "I'm fed up with your service. I'm contemplating canceling my subscription.", "intent": "Churn"},
    {"text": "Your support is inadequate. I need assistance from someone who knows what they're doing.", "intent": "Escalation"},
    {"text": "I had an awful experience with your company, and I want to escalate this issue to a higher authority.", "intent": "Churn and Escalation"},
    {"text": "How do I change my contact information in the account settings?", "intent": "No Intent Found"},
    {"text": "I've been a loyal customer for years, but your recent service has been dreadful. I'm thinking of leaving and want to discuss this with your team leader.", "intent": "Churn and Escalation"},
    {"text": "Can I access your service on my smartphone?", "intent": "No Intent Found"},
    {"text": "I'm uncertain about continuing my subscription with your IT support service.", "intent": "Churn"},
    {"text": "Your service has been a consistent source of frustration. I'm contemplating unsubscribing.", "intent": "Churn"},
    {"text": "I'm making no headway with your support team. I need a capable person to assist me.", "intent": "Escalation"},
    {"text": "I had an atrocious experience with your company's service, and I'm considering alternatives. I want to speak to a senior representative.", "intent": "Churn and Escalation"},
    {"text": "How can I modify my billing address in my account?", "intent": "No Intent Found"},
    {"text": "I've been a loyal customer, but your recent service is unacceptable. I'm contemplating leaving and want to discuss this with someone who can help.", "intent": "Churn and Escalation"},
    {"text": "Is there a mobile app for your service?", "intent": "No Intent Found"},
    {"text": "I'm thinking about ending my subscription with your IT support service.", "intent": "Churn"},
    {"text": "I'm frustrated with your service. I'm considering canceling my subscription.", "intent": "Churn"},
    {"text": "Your support is inadequate. I need assistance from someone who knows what they're doing.", "intent": "Escalation"},
    {"text": "I had an awful experience with your company, and I want to escalate this issue to a higher authority.", "intent": "Churn and Escalation"},
    {"text": "How do I change my contact information in the account settings?", "intent": "No Intent Found"},
    {"text": "I've been a loyal customer for years, but your recent service has been dreadful. I'm thinking of leaving and want to discuss this with your team leader.", "intent": "Churn and Escalation"},
    {"text": "Can I access your service on my smartphone?", "intent": "No Intent Found"},
    {"text": "I'm uncertain about continuing my subscription with your IT support service.", "intent": "Churn"},
    {"text": "Your service has been a consistent source of frustration. I'm contemplating unsubscribing.", "intent": "Churn"},
    {"text": "I'm making no headway with your support team. I need a capable person to assist me.", "intent": "Escalation"},
    {"text": "I had an atrocious experience with your company's service, and I'm considering alternatives. I want to speak to a senior representative.", "intent": "Churn and Escalation"},
    {"text": "How can I modify my billing address in my account?", "intent": "No Intent Found"},
    {"text": "I've been a loyal customer, but your recent service is unacceptable. I'm contemplating leaving and want to discuss this with someone who can help.", "intent": "Churn and Escalation"},
    {"text": "Is there a mobile app for your service?", "intent": "No Intent Found"},
    {"text": "Your product is a disappointment. Can I get a refund?", "intent": "Churn"},
    {"text": "I need to escalate this issue to a supervisor.", "intent": "Escalation"},
    {"text": "Do you have any better options than what you're offering?", "intent": "Churn"},
    {"text": "I'm fed up with your service. I want my money back.", "intent": "Churn"},
    {"text": "I demand to speak with someone in charge.", "intent": "Escalation"},
    {"text": "Your service quality has declined. Are there alternatives?", "intent": "Churn"},
    {"text": "I've had enough of your poor service. I'm leaving.", "intent": "Churn"},
    {"text": "I'm not satisfied with your help. Connect me to a supervisor.", "intent": "Escalation"},
    {"text": "Can you suggest a better service than yours?", "intent": "Churn"},
    {"text": "I'm unhappy with your product. Can I return it?", "intent": "Churn"},
    {"text": "Your customer support is terrible. I need assistance now.", "intent": "Escalation"},
    {"text": "I'm fed up with your company. Is there a way to cancel my subscription?", "intent": "Churn"},
    {"text": "I'm extremely disappointed with your service. Get me a manager.", "intent": "Escalation"},
    {"text": "I'm exploring other options. Your service isn't meeting my needs.", "intent": "Churn"},
    {"text": "I'm not getting what I paid for. I want a refund.", "intent": "Churn"},
    {"text": "I'm frustrated. Transfer me to a higher authority.", "intent": "Escalation"},
    {"text": "Can you recommend a better product than yours?", "intent": "Churn"},
    {"text":"nice app, nice service", "intent":"No Intent Found"},
    {"text": "I've had it with your service. How can I terminate my subscription?", "intent": "Churn"},
    {"text": "I'm disgusted with your support. I need to talk to a supervisor.", "intent": "Escalation"},
    {"text": "I'm thinking of switching providers. Any suggestions?", "intent": "Churn"},
    {"text": "Your product is terrible. I want a refund.", "intent": "Churn"},
    {"text": "I'm not getting the help I need. Get me someone higher up.", "intent": "Escalation"},
    {"text": "Your service doesn't meet my standards. Can I cancel?", "intent": "Churn"},
    {"text": "I'm extremely dissatisfied with your company. I need a manager.", "intent": "Escalation"},
    {"text": "I'm looking for better options. Your service isn't cutting it.", "intent": "Churn"},
    {"text": "I'm disappointed. Can I return your product?", "intent": "Churn"},
    {"text": "I'm not getting proper support. Connect me to a supervisor.", "intent": "Escalation"},
    {"text": "Is there a way to cancel my subscription? I'm not satisfied.", "intent": "Churn"},
    {"text": "I'm fed up with your service. Get me a higher authority.", "intent": "Escalation"},
    {"text": "Can you suggest a better alternative to your service?", "intent": "Churn"},
    {"text": "Your product is terrible. Can I get a refund?", "intent": "Churn"},
    {"text": "I'm tired of your support. Connect me to a supervisor.", "intent": "Escalation"},
    {"text": "I'm considering switching to a different provider.", "intent": "Churn"},
    {"text": "Your service is not up to the mark. Are there any alternatives?", "intent": "Churn"},
    {"text": "How do I clear my browser cache?", "intent": "No Intent Found"},
    {"text": "What are the system requirements for your software?", "intent": "No Intent Found"},
    {"text": "Where can I find your company's contact information?", "intent": "No Intent Found"},
    {"text": "Do you have a mobile app for your service?", "intent": "No Intent Found"},
    {"text": "I'm looking for your privacy policy.", "intent": "No Intent Found"},
    {"text": "How do I reset my password on your website?", "intent": "No Intent Found"},
    {"text": "I've had enough of your unreliable service. Get me a supervisor now.", "intent": "Churn and Escalation"},
    {"text": "Your product is a disaster, and your support team is useless. I demand to speak to a manager.", "intent": "Churn and Escalation"},
    {"text": "I'm fed up with your company's terrible service, and I need a solution immediately.", "intent": "Churn and Escalation"},
    {"text": "This is the last straw. I'm canceling my subscription, and I want to escalate this issue to your management.", "intent": "Churn and Escalation"},
    {"text": "Your support is a joke. I want a refund, and I want to speak to someone in charge.", "intent": "Churn and Escalation"},
    {"text": "Your service is unacceptable. I'm leaving, and I want a supervisor to address this issue.", "intent": "Churn and Escalation"},
    {"text":"I'd like to cancel my subscription.", "intent":"Churn"},
    {"text":"I am leaving","intent":"Churn"},
    {"text":"I need assistance with my account.","intent":"Escalation"},
    {"text":"This product is amazing!","intent":"No Intent Found"},
    {"text":"How do I return this item?","intent":"No Intent Found"},
    {"text":"I'm interested in upgrading my plan.","intent":"No Intent Found"},
    {"text":"Can you help me with a technical issue?","intent":"Escalation"},
    {"text":"I want to report a bug in the app.","intent":"Escalation"},
    {"text":"What are your product's features?","intent":"No Intent Found"},
    {"text":"I have a billing inquiry.","intent":"Escalation"},
    {"text":"How can I contact customer support?","intent":"Escalation"},
    {"text":"Tell me more about your return policy", "intent" :"No Intent Found"},
    {"text":"I'd like to subscribe to your newsletter.", "intent":"No Intent Found"},
    {"text":"I'm disappointed with your product. Put me in touch with someone in charge to resolve this.","intent":"Churn and Escalation"},
    {"text":"I'm seriously considering canceling my subscription. Connect me with a manager to discuss this matter","intent":"Churn and Escalation"},
    {"text":"Your support is a disaster. I need a refund, and I want to talk to a senior representative.","intent":"Churn and Escalation"},
    {"text":"I can't stand your company anymore. Cancel my subscription.","intent":"Churn"},
    {"text":"I am in love with your service.","intent":"No Intent Found"},
    {"text":"Good service, worthy subscription.","intent":"No Intent Found"},
    {"text":"Loved the support.", "intent":"No Intent Found"},
    {"text":"I want to unsubscribe", "intent":"Churn"},
    {"text":"I want to subscribe","intent":"No Intent Found"},
    {"text":"I've been waiting for support for hours, and I'm not getting any response. I want to talk to a supervisor now.","intent":"Escalation"},
    {"text":"Your team has failed to address my problem. Get me in touch with a manager immediately.","intent":"Escalation"},
    {"text":"I've tried contacting support multiple times, and I'm still facing the same problem. Transfer me to your escalation team.","intent":"Escalation"},
    {"text":"I need immediate assistance, and the standard support isn't helping. Escalate my issue, please.","intent":"Escalation"},
    {"text":"I'm not satisfied with the response I received from your team. Put me through to someone with more authority.","intent":"Escalation"},
    {"text":"I need this issue sorted out urgently. Connect me with a senior representative.","intent":"Escalation"},
    {"text":"I'm on the verge of leaving your company. I need to speak to a manager who can address my concerns or I'm canceling my account.","intent":"Churn and Escalation"},
    {"text":"Your product isn't meeting my expectations, and your support isn't helping. I'm seriously considering canceling my subscription. I demand an immediate solution.","intent":"Churn and Escalation"},
    {"text":"I can't tolerate this any longer. I'm canceling my subscription. Get me in touch with your escalation team to discuss my decision.","intent":"Churn and Escalation"},
    {"text":"I've had too many issues, and your support isn't responsive. I'm thinking about leaving. I want to talk to a senior representative about this matter.","intent":"Churn and Escalation"},
    {"text":"Your service is awful, and I'm leaving. I insist on speaking to a manager right now to discuss the terms of my departure.","intent":"Churn and Escalation"},
    {"text":"Your product isn't meeting my expectations, and your support isn't helping. I'm seriously considering canceling my subscription. I demand an immediate solution.","intent":"Churn and Escalation"},
    {"text":"I'm on the verge of leaving your company. I need to speak to a manager who can address my concerns or I'm canceling my account.","intent":"Churn and Escalation"}


    
]
